
boot-loader.elf:     file format elf32-bigarm

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .text         0000210c  00010000  00010000  00008000  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, CODE
  1 .bss          00000050  00000000  00000000  00000074  2**0
                  ALLOC
  2 .stack        000020b0  00000050  00000050  00000074  2**0
                  ALLOC
  3 .debug_aranges 00000080  00000000  00000000  0000a10c  2**0
                  CONTENTS, READONLY, DEBUGGING
  4 .debug_pubnames 000000f3  00000000  00000000  0000a18c  2**0
                  CONTENTS, READONLY, DEBUGGING
  5 .debug_info   000009f4  00000000  00000000  0000a27f  2**0
                  CONTENTS, READONLY, DEBUGGING
  6 .debug_abbrev 00000452  00000000  00000000  0000ac73  2**0
                  CONTENTS, READONLY, DEBUGGING
  7 .debug_line   00000274  00000000  00000000  0000b0c5  2**0
                  CONTENTS, READONLY, DEBUGGING
  8 .debug_frame  000001a0  00000000  00000000  0000b33c  2**2
                  CONTENTS, READONLY, DEBUGGING
  9 .debug_str    000003aa  00000000  00000000  0000b4dc  2**0
                  CONTENTS, READONLY, DEBUGGING
 10 .debug_loc    000007f0  00000000  00000000  0000b886  2**0
                  CONTENTS, READONLY, DEBUGGING
The section .debug_aranges contains:

  Length:                   28
  Version:                  2
  Offset into .debug_info:  0
  Pointer Size:             4
  Segment Size:             0


     DW_AT_decl_line   : 100	
     DW_AT_type        : <638>	
 <2><52f>: Abbrev Number: 16 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x1a3): bufsz	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 101	
     DW_AT_type        : <4bc>	
     DW_AT_location    : 0x603	(location list)
 <2><53e>: Abbrev Number: 17 (DW_TAG_variable)
     DW_AT_name        : crc	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 101	
     DW_AT_type        : <4bc>	
     DW_AT_location    : 1 byte block: 57 	(DW_OP_reg7)
 <2><54b>: Abbrev Number: 16 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x1a9): trychar	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 102	
     DW_AT_type        : <4ce>	
     DW_AT_location    : 0x62c	(location list)
 <2><55a>: Abbrev Number: 15 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x15b): packetno	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 103	
     DW_AT_type        : <4ce>	
     DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8)
 <2><567>: Abbrev Number: 6 (DW_TAG_variable)
     DW_AT_name        : i	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 104	
     DW_AT_type        : <4bc>	
 <2><570>: Abbrev Number: 18 (DW_TAG_variable)
     DW_AT_name        : c	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 104	
     DW_AT_type        : <4bc>	
     DW_AT_location    : 0x64a	(location list)
 <2><57d>: Abbrev Number: 17 (DW_TAG_variable)
     DW_AT_name        : len	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 104	
     DW_AT_type        : <4bc>	
     DW_AT_location    : 1 byte block: 56 	(DW_OP_reg6)
 <2><58a>: Abbrev Number: 16 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x19d): retry	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 105	
     DW_AT_type        : <4bc>	
     DW_AT_location    : 0x6aa	(location list)
 <2><599>: Abbrev Number: 15 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x1b8): retrans	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 105	
     DW_AT_type        : <4bc>	
     DW_AT_location    : 1 byte block: 5a 	(DW_OP_reg10)
 <2><5a6>: Abbrev Number: 7 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x176): wait	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 106	
     DW_AT_type        : <656>	
 <2><5b1>: Abbrev Number: 19 (DW_TAG_label)
     DW_AT_name        : (indirect string, offset: 0x17b): start_recv	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 159	
     DW_AT_low_pc      : 0x10b20	
 <2><5bc>: Abbrev Number: 19 (DW_TAG_label)
     DW_AT_name        : (indirect string, offset: 0x16f): reject	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 208	
     DW_AT_low_pc      : 0x10c9c	
 <2><5c7>: Abbrev Number: 20 (DW_TAG_inlined_subroutine)
     DW_AT_sibling     : <61e>	
     DW_AT_abstract_origin: <458>	
     DW_AT_low_pc      : 0x10b9c	
     DW_AT_high_pc     : 0x10c18	
     DW_AT_call_file   : 1	
     DW_AT_call_line   : 174	
 <3><5da>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     DW_AT_abstract_origin: <47f>	
 <3><5df>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     DW_AT_abstract_origin: <474>	
 <3><5e4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
     DW_AT_abstract_origin: <469>	
 <3><5e9>: Abbrev Number: 22 (DW_TAG_lexical_block)
     DW_AT_sibling     : <601>	
     DW_AT_low_pc      : 0x10bc4	
     DW_AT_high_pc     : 0x10be4	
 <4><5f6>: Abbrev Number: 23 (DW_TAG_variable)
     DW_AT_abstract_origin: <48e>	
 <4><5fb>: Abbrev Number: 23 (DW_TAG_variable)
     DW_AT_abstract_origin: <499>	
 <3><601>: Abbrev Number: 24 (DW_TAG_lexical_block)
     DW_AT_low_pc      : 0x10be4	
     DW_AT_high_pc     : 0x10c18	
 <4><60a>: Abbrev Number: 25 (DW_TAG_variable)
     DW_AT_abstract_origin: <4a6>	
     DW_AT_location    : 0x6d3	(location list)
 <4><613>: Abbrev Number: 25 (DW_TAG_variable)
     DW_AT_abstract_origin: <4af>	
     DW_AT_location    : 0x6f1	(location list)
 <2><61e>: Abbrev Number: 24 (DW_TAG_lexical_block)
     DW_AT_low_pc      : 0x10c24	
     DW_AT_high_pc     : 0x10c64	
 <3><627>: Abbrev Number: 16 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x7f): count	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 178	
     DW_AT_type        : <4bc>	
     DW_AT_location    : 0x730	(location list)
 <1><638>: Abbrev Number: 10 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 4	
     DW_AT_type        : <4ce>	
 <1><63e>: Abbrev Number: 26 (DW_TAG_array_type)
     DW_AT_sibling     : <64f>	
     DW_AT_type        : <4ce>	
 <2><647>: Abbrev Number: 27 (DW_TAG_subrange_type)
     DW_AT_type        : <64f>	
     DW_AT_upper_bound : 1029	
 <1><64f>: Abbrev Number: 12 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x4a): long unsigned int	
     DW_AT_byte_size   : 4	
     DW_AT_encoding    : 7	(unsigned)
 <1><656>: Abbrev Number: 12 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x4f): unsigned int	
     DW_AT_byte_size   : 4	
     DW_AT_encoding    : 7	(unsigned)
  Compilation Unit @ offset 0x65e:
   Length:        914
   Version:       2
   Abbrev Offset: 868
   Pointer Size:  4
 <0><669>: Abbrev Number: 1 (DW_TAG_compile_unit)
     DW_AT_stmt_list   : 0x211	
     DW_AT_high_pc     : 0x10e18	
     DW_AT_low_pc      : 0x10cc0	
     DW_AT_producer    : (indirect string, offset: 0x109): GNU C 4.1.1 (WinARM)	
     DW_AT_language    : 1	(ANSI C)
     DW_AT_name        : (indirect string, offset: 0x361): elfsplitter.c	
     DW_AT_comp_dir    : (indirect string, offset: 0xce): D:\arm-storm-sdram2\sw\amber-btldr.works	
 <1><683>: Abbrev Number: 2 (DW_TAG_structure_type)
     DW_AT_sibling     : <750>	
     DW_AT_byte_size   : 52	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 78	
 <2><68b>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x392): e_ident	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 79	
     DW_AT_type        : <750>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><699>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x262): e_e_type	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 80	
     DW_AT_type        : <76e>	
     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><6a7>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x2e1): e_machine	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 81	
     DW_AT_type        : <76e>	
     DW_AT_data_member_location: 2 byte block: 23 12 	(DW_OP_plus_uconst: 18)
 <2><6b5>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x223): e_version	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 82	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><6c3>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x27e): e_entry	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 83	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><6d1>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x2c4): e_phoff	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 84	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><6df>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x251): e_shoff	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 85	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><6ed>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x359): e_flags	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 86	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><6fb>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x1e9): e_ehsize	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 87	
     DW_AT_type        : <76e>	
     DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><709>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x323): e_phentsize	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 88	
     DW_AT_type        : <76e>	
     DW_AT_data_member_location: 2 byte block: 23 2a 	(DW_OP_plus_uconst: 42)
 <2><717>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x302): e_phnum	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 89	
     DW_AT_type        : <76e>	
     DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><725>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x2f6): e_shentsize	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 90	
     DW_AT_type        : <76e>	
     DW_AT_data_member_location: 2 byte block: 23 2e 	(DW_OP_plus_uconst: 46)
 <2><733>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x3a2): e_shnum	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 91	
     DW_AT_type        : <76e>	
     DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><741>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x246): e_shstrndx	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 92	
     DW_AT_type        : <76e>	
     DW_AT_data_member_location: 2 byte block: 23 32 	(DW_OP_plus_uconst: 50)
 <1><750>: Abbrev Number: 4 (DW_TAG_array_type)
     DW_AT_sibling     : <760>	
     DW_AT_type        : <767>	
 <2><759>: Abbrev Number: 5 (DW_TAG_subrange_type)
     DW_AT_type        : <760>	
     DW_AT_upper_bound : 15	
 <1><760>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x4a): long unsigned int	
     DW_AT_byte_size   : 4	
     DW_AT_encoding    : 7	(unsigned)
 <1><767>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x186): unsigned char	
     DW_AT_byte_size   : 1	
     DW_AT_encoding    : 8	(unsigned char)
 <1><76e>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x12e): short unsigned int	
     DW_AT_byte_size   : 2	
     DW_AT_encoding    : 7	(unsigned)
 <1><775>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x4f): unsigned int	
     DW_AT_byte_size   : 4	
     DW_AT_encoding    : 7	(unsigned)
 <1><77c>: Abbrev Number: 7 (DW_TAG_typedef)
     DW_AT_name        : (indirect string, offset: 0x1df): ElfHeader	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 93	
     DW_AT_type        : <683>	
 <1><787>: Abbrev Number: 2 (DW_TAG_structure_type)
     DW_AT_sibling     : <800>	
     DW_AT_byte_size   : 32	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 97	
 <2><78f>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x202): p_type	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 98	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><79d>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x259): p_offset	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 99	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><7ab>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x312): p_vaddr	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 100	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><7b9>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x236): p_paddr	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 101	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><7c7>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x1f9): p_filesz	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 102	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><7d5>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x286): p_memsz	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 103	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><7e3>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x30a): p_flags	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 104	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><7f1>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x21b): p_align	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 105	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <1><800>: Abbrev Number: 7 (DW_TAG_typedef)
     DW_AT_name        : (indirect string, offset: 0x32f): Elf32_Phdr	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 106	
     DW_AT_type        : <787>	
 <1><80b>: Abbrev Number: 2 (DW_TAG_structure_type)
     DW_AT_sibling     : <8a0>	
     DW_AT_byte_size   : 40	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 110	
 <2><813>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x2af): sh_name	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 111	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><821>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x39a): sh_type	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 112	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><82f>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x31a): sh_flags	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 113	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><83d>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x209): sh_addr	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 114	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><84b>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x2d7): sh_offset	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 115	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><859>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x23e): sh_size	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 116	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><867>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x296): sh_link	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 117	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><875>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x276): sh_info	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 118	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><883>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x2b7): sh_addralign	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 119	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><891>: Abbrev Number: 3 (DW_TAG_member)
     DW_AT_name        : (indirect string, offset: 0x2eb): sh_entsize	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 120	
     DW_AT_type        : <775>	
     DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <1><8a0>: Abbrev Number: 7 (DW_TAG_typedef)
     DW_AT_name        : (indirect string, offset: 0x26b): Elf32_Shdr	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 121	
     DW_AT_type        : <80b>	
 <1><8ab>: Abbrev Number: 8 (DW_TAG_subprogram)
     DW_AT_sibling     : <99b>	
     DW_AT_external    : 1	
     DW_AT_name        : (indirect string, offset: 0x29e): elfsplitter	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 189	
     DW_AT_prototyped  : 1	
     DW_AT_type        : <99b>	
     DW_AT_low_pc      : 0x10cc0	
     DW_AT_high_pc     : 0x10e18	
     DW_AT_frame_base  : 0x76f	(location list)
 <2><8c8>: Abbrev Number: 9 (DW_TAG_formal_parameter)
     DW_AT_name        : (indirect string, offset: 0x2aa): base	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 188	
     DW_AT_type        : <775>	
     DW_AT_location    : 0x78e	(location list)
 <2><8d7>: Abbrev Number: 9 (DW_TAG_formal_parameter)
     DW_AT_name        : (indirect string, offset: 0xb): size	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 188	
     DW_AT_type        : <775>	
     DW_AT_location    : 0x7a1	(location list)
 <2><8e6>: Abbrev Number: 10 (DW_TAG_variable)
     DW_AT_name        : buf	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 190	
     DW_AT_type        : <9a2>	
     DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5)
 <2><8f3>: Abbrev Number: 11 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x64): length	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 191	
     DW_AT_type        : <775>	
 <2><8fe>: Abbrev Number: 12 (DW_TAG_variable)
     DW_AT_name        : d	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 191	
     DW_AT_type        : <775>	
 <2><907>: Abbrev Number: 10 (DW_TAG_variable)
     DW_AT_name        : i	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 191	
     DW_AT_type        : <775>	
     DW_AT_location    : 1 byte block: 57 	(DW_OP_reg7)
 <2><912>: Abbrev Number: 11 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x1f2): gp_ptr	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 191	
     DW_AT_type        : <775>	
 <2><91d>: Abbrev Number: 11 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x211): bss_start	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 192	
     DW_AT_type        : <775>	
 <2><928>: Abbrev Number: 11 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x28e): bss_end	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 192	
     DW_AT_type        : <775>	
 <2><933>: Abbrev Number: 11 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x33a): StringSectionOffset	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 193	
     DW_AT_type        : <775>	
 <2><93e>: Abbrev Number: 11 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x36f): StringSectionOffsetFound	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 194	
     DW_AT_type        : <775>	
 <2><949>: Abbrev Number: 12 (DW_TAG_variable)
     DW_AT_name        : tmp	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 196	
     DW_AT_type        : <9a8>	
 <2><954>: Abbrev Number: 13 (DW_TAG_variable)
     DW_AT_name        : j	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 197	
     DW_AT_type        : <775>	
     DW_AT_location    : 0x7b4	(location list)
 <2><961>: Abbrev Number: 13 (DW_TAG_variable)
     DW_AT_name        : k	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 197	
     DW_AT_type        : <775>	
     DW_AT_location    : 0x7dd	(location list)
 <2><96e>: Abbrev Number: 12 (DW_TAG_variable)
     DW_AT_name        : m	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 198	
     DW_AT_type        : <99b>	
 <2><977>: Abbrev Number: 11 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x388): elfHeader	
     DW_AT_decl_file   : 1	
     DW_AT_decl_line   : 199	
